<?php

return [
    'alarm' => [
        'title' => 'Сигнал тривоги',
        'desc' => 'Встановіть кризове повідомлення, яке буде відтворено в кризовий центр, коли тривожна сигналізація',
        'field' => [
            'group' => [
                'label' => 'Кризовий центр',
                'value' => 'Будь ласка виберіть повідомлення про кризу'
            ],
            'media' => [
                'label' => 'Повідомлення про кризу',
                'value' => 'Будь ласка виберіть повідомлення про кризу'
            ],
            'interrupt' => [
                'label' => 'Виберіть повідомлення для іншої частини у виклику',
                'value' => 'Жоден'
            ],
            'save' => [
                'label' => 'Зберегти налаштування сигналу тривоги'
            ]
        ]
    ],
    'broadcast' => [
        'title' => 'Пряма трансляція',
        'desc' => 'Встановити номер телефону по замовчуванню для трансляції',
        'field' => [
            'number' => [
                'label' => 'Номер телефону для трансляції онлайн'
            ],
            'save' => [
                'label' => 'Зберегти номер телефону'
            ]
        ]
    ]
];
