<?php

return [
    'play' => [
        'field' => [
            'voice' => [
                'placeholder' => 'Виберіть звукове повідомлення'
            ],
            'group' => [
                'placeholder' => 'Виберіть групу пристроїв'
            ],
            'submit' => 'Відтворення на пристроях'
        ],
        'toast' => [
            'success' => [
                'title' => 'Успішно',
                'message' => 'Голосове повідомлення успішно відтворено.'
            ],
            'error' => [
                'playback' => [
                    'title' => 'Помилка відтворення',
                    'message' => 'Помилка відтворення голосового повідомлення для вибраної групи.'
                ],
                'invalid' => [
                    'title' => 'Помилка',
                    'message' => 'Надано недійсне голосове повідомлення або групу.'
                ]
            ]
        ]
    ],
    'live' => [
        'heading' => 'Транслювати нове звукове повідомлення',
        'field' => [
            'group' => [
                'placeholder' => 'Виберіть групу пристроїв'
            ],
            'number' => [
                'label' => 'Будь ласка введіть внутрішній номер телефону, який буде використовуватися для трансляції повідомлення в прямому ефірі.',
                'placeholder' => 'Номер телефону'
            ],
            'submit' => 'Почати трансляцію'
        ],
        'toast' => [
            'success' => [
                'title' => 'Успішно',
                'message' => 'Номер телефону успішно викликано.'
            ],
            'error' => [
                'playback' => [
                    'title' => 'Помилка відтворення',
                    'message' => 'Помилка здійснення виклику.'
                ],
                'invalid' => [
                    'title' => 'Помилка',
                    'message' => 'Надано недійсний номер телефону або групу.'
                ]
            ]
        ]
    ]
];