<?php
return [
    'save' => 'Зберегти',
    'tabs' => [
        'general' => 'Загальні налаштування',
        'help' => 'Допомога',
        'sms' => 'Інформаційне управління SMS',
        'phone' => 'Система телефону',
        'push' => 'Керування Push-сповіщеннями',
        'buttons' => 'ІР-кнопки',
        'team' => 'Перелік кризових центрів',
        'reset' => 'Перезавантаження Кризового центру'
    ],
    'general' => [
        'title' => 'Загальні налаштування',
        'description' => 'Встановіть загальні налаштування/Встановлення загальних налаштувань',
        'labels' => [
            'timezone' => 'Часовий пояс за замовчуванням',
            'language' => 'мова за замовчуванням',
            'reconnect' => 'Стандартне поновлення підключення (повторне підключення за замовчуванням)',
            'ordering' => 'Стандартний порядок у черзі  '
        ],
        'save' => 'Зберегти'
    ],
    'api' => [
        'title' => 'API Конфігурація',
        'description' => 'Пояснювальний текст про  api конфігурацію',
        'labels' => [
            'sms_provider' => 'SMS провайдер',
            'phone_system_provider' => 'Провайдер системи телефона',
            'user_data_source' => 'Джерело даних користувача',
            'client_data_source' => 'Джерело місцезнаходження пристрою'
        ]
    ],
    'buttons' => [
        'title' => 'Кнопки',
        'description' => 'Налаштування кнопок IP',
        'add' => 'Додати кнопку',
        'table' => [
            'number' => 'Номер кнопки',
            'name' => 'Назва кнопки',
            'cbf' => 'Територія, будівля, поверх',
            'mac' => 'Кризовий центр PC MAC',
            'ip' => 'Кризовий центр PC IP',
            'x' => 'X',
            'y' => 'Y',
            'options' => 'Параметри'
        ],
        'placeholder' => 'Будь ласка виберіть'

    ],
    'maps' => [
        'title' => 'Мапи (карти)',
        'description' => 'Пояснення щодо опису',
        'sync' => 'Синхронізувати вручну'
    ],
    'push' => [
        'title' => 'Push-сповіщення',
        'description' => 'Керуйте (керувати) шаблонами Push-сповіщень',
        'button' => [
            'new' => 'Нове сповіщення про установки по замовчуванню',
            'import' => 'Імпортувати налаштування за замовчуванням',
            'show' => 'Показати',
            'hide' => 'Приховати'
        ],
        'table' => [
            'label' => 'Мітка сповіщень',
            'content' => 'Зміст сповіщень ',
            'options' => 'Параметри (опції)',
        ]
    ],
    'sms' => [
        'title' => 'SMS повідомлення',
        'description' => 'Налаштуйте sms-повідомлення, які будуть відправлятися при сигналі тривоги.',
        'trigger' => 'Повідомлення про початковий сигнал тривоги',
        'symbols' => 'Символів залишилось:',
        'default' => 'Стандартне повідомлення (повідомлення по замовчуванню):',
        'information' => 'Інформаційне повідомлення кризового центру',
        'save' => 'Зберегти',
    ],
    'team' => [
        'title' => 'Кризовий центр',
        'description' => 'Синхронізуйте та перегляньте членів кризового центру',
        'button' => [
            'sync' => 'Члени процесу синхронізації',
        ],
        'table' => [
            'name' => 'Ім\'я',
            'email' => 'Електронна пошта',
            'phone' => 'Номер мобільного телефону'
        ]
    ],
];