<?php

return [
    'header' => [
        'menu' => [
            'main' => [
                'help' => 'Довідкова документація',
                'plan' => 'План школи',
                'stream' => 'Відео стрім'
            ],
            'users' => [
                'help' => 'Допомога',
                'settings' => 'Налаштування'
            ]
        ]
    ],
    'stream' => [
        'add' => 'Додати',
        'chat_with' => 'Чат із:',
        'conversation' => 'Бесіда',
        'minimize' => 'Закрити потік',
        'close_chat' => 'Вибрати чат',
        'police_called' => '112',
        'mobile' => [
            'battery_loading' => 'Акумулятор: Завантаження',
            'battery' => 'Акумулятор: ',

        ],
        'placeholder' => 'Введіть повідомлення',
        'button' => [
            'messages' => 'Повідомлення',
            'answer' => 'Відповідь',
            'hold' => 'Утримується',
            'minimize' => 'Згорнути',
            'mute' => 'Без звуку',
            'unmute' => 'Увімкнути звук',
            'zoom_in' => 'Приближення',
            'zoom_out' => 'Віддалення',
        ],
        'empty' => [
            'title' => 'Порожнє місце для відеопотоку',
            'select' => 'Виберіть потік з черги або списку нижче',
            'placeholder' => 'Вибрати потік',
        ]
    ],
    'message' => [
        'stream' => 'Потік повідомлень',
        'type' => 'Введіть повідомлення'
    ],
    'police' => [
        'called' => [
            'no' => 'Поліцію не було викликано.',
            'yes' => 'Викликано поліцію.',
            'asked' => 'Desktop App попросив викликати поліцію'
        ],
        'switch' => [
            'status' => 'Змінити статус поліції',
            'called' => 'Викликано',
            'not_called' => 'Не викликано'
        ],
        'status' => [
            'label' => 'Статус тривоги',
            'on' => 'Ввімкнути',
            'off' => 'Вимкнути',
            'started' => 'Запущено',
            'not_started' => 'Не запущено',
            'police_called' => 'Зателефоновано до поліції',
            'users' => 'Користувачі',
            'times' => 'Кількість разів'
        ]
    ],
    'trigger' => [
        'message' => 'З\'єднуємо з центром управління кризою, зачекайте будь ласка.....'
    ],
    'tac' => [
        'default' => 'T&C default text..[UK]'
    ]
];