<?php

return [
    'header' => 'Швидка допомога',
    'description' => 'Налаштування за замовчуванням для сторінки довідки',
    'file_label' => 'Короткі інструкції (PDF)',
    'police_file_label' => 'Короткі інструкції для поліції (PDF)',
    'file_description' => 'Опис документу',
    'browse' => 'Приєднати',
    'save' => 'Зберегти',
    'faq' => 'Часті питання',
    'faq_description' => 'Установка популярних питаннь  за замовчуванням',
    'faq_capitals' => 'FAQ',
    'new_faq' => 'Нові FAQ',
    'question' => 'Питання',
    'answer' => 'Відповіді',
    'options' => 'Параметри',
    'download' => 'Завантажити інструкції PDF за замовчуванням',
    'download_police' => 'Завантажити інструкції PDF для поліції за замовчуванням',
    'enter_text' => 'Введіть текст сюди',
    'import_defaults' => 'Імпортувати за замовчуванням',
    'tour_ui' => [
        'next' => 'Наступний',
        'prev' => 'Попередній'
    ],

];