<?php

return [
    'toolbox' => [
        'zoom' => 'Ближче/далі',
        'tools' => 'Інструменти',
        'building' => 'Виберіть будівлю',
        'floor' => 'Виберіть поверх'
    ],
    'messages' => [
        'batch_select' => 'Вибір групи користувачів:',
        'label' => 'Надилати повідомлення',
        'tabs' => [
            'push' => 'Push-сповіщення',
            'audio' => 'Звук / аудіо',
            'history' => 'Історія',
        ],
        'button' => [
            'all' => 'Всі',
            'floor' => 'Поверх',
            'building' => 'Будівля',
            'none' => 'Жоден'
        ],
        'placeholder' => [
            'select_template' => 'Виберіть шаблон',
            'enter_message' => 'Введіть текст повідомлення тут...',
            'symbols' => 'Залишилось символів:'
        ],
        'history' => [
            'time' => 'Час',
            'message' => 'Повідомлення',
            'type' => 'Тип',
            'result' => 'Результат',
            'gotit' => 'Зрозуміло'
        ],
        'send' => 'Надіслати',
    ]
];