<?php
return [
    'title' => [
        'success' => 'Успішно',
        'error' => 'Помилка',
        'message_sent' => 'Повідомлення надіслано',
        'message_played' => 'Повідомлення відтворено',
        'error_playing' => 'Помилка відтворення повідомлення',
        'warning' => 'Застереження (Увага!)'
    ],
    'contents' => [
        'validation' => [
            'required' => 'Обов\'язкове поле',
            'max_char' => 'Поле не може перевищувати 144 символи'
        ],
        'reset' => [
            'message' => 'Ви дійсно хочете перевстановити Shelter?',
            'success' => 'Shelter перевстановлено. Перезавантаження сторінки.',
        ],
        'school' => [
            'push' => [
                'select_client' => 'Будь ласка виберіть хоча б одного клієнта.',
                'no_message' => 'Введіть повідомлення або виберіть шаблон повідомлення.',
                'too_long' => 'Повідомлення занадто довге.',
                'sent' => 'Push-сповіщення було надіслано.',
                'not_sent' => 'Push-повідомлення не було надіслано.',

            ]
        ],
        'system' => [
            'button' => [
                'save_success' => 'Кнопку успішно збережено.',
                'save_error' => 'Не вдалося зберегти кнопку.',
                'remove_success' => 'Кнопку було успішно видалено.',
                'remove_message' => 'Ви дійсно бажаєте видалити цю кнопку?'
            ],
            'faq' => [
                'save_success' => 'Питання збережено.',
                'save_error' => 'Не вдалося зберегти запитання.',
                'order_success' => 'Замовлення збережено.',
                'remove_success' => 'Питання видалено.',
                'remove_message' => 'Ви дійсно бажаєте видалити це запитання?',
                'settings_saved' => 'Налаштування установок швидкої допомоги збережено.'

            ],
            'maps' => [
                'sync' => 'Синхронізація мап. Зачекайте будь ласка.',
                'sync_success' => 'Мапи синхронізовані. Перезавантаження сторінки.'
            ],
            'push' => [
                'save_success' => 'Шаблон сповіщень успішно збережено.',
                'save_error' => 'Не вдалося зберегти шаблон сповіщення.',
                'remove_message' => 'Ви дійсно бажаєте видалити цей шаблон сповіщень?',
                'remove_success' => 'Шаблон сповіщень видалено.',
                'order_success' => 'Замовлення збережено.'
            ],
            'school' => [
                'save_success' => 'Дані школи збережено.',
                'save_error' => 'Неможливо зберегти дані школи.',
                'sync' => 'Синхронізація шкіл. Чекайте будь ласка.',
                'sync_success' => 'Школи синхронізовані. Перезавантаження сторінки.',
                'remove_message' => 'Ви дійсно хочете видалити цю школу?',
                'remove_success' => 'Школу видалено успішно.'
            ]
        ],
        'admin' => [
              'button' => [
                  'save_success' => 'Кнопку успішно збережено.',
                  'save_error' => 'Не вдалося зберегти кнопку.',
                  'remove_success' => 'Кнопку видалено.'
              ],
            'team' => [
                'sync' => 'Синхронізація членів кризового центру. Чекайте будь ласка.',
                'complete' => 'Членів кризового центру синхронізовано. Сторінка перезавантажується.'
            ],
            'faq' => [
                'save_success' => 'Питання збережено.',
                'save_error' => 'Не вдалося зберегти запитання.',
                'order_success' => 'Замовлення збережено.',
                'remove_success' => 'Питання успішо збережено.',
                'remove_message' => 'Ви дійсно бажаєте видалити це запитання?',
                'import_message' => 'Ви дійсно бажаєте імпортувати запитання за замовчуванням?',
                'import_success' => 'Питання імпортовано. Перезавантаження сторінки.',
                'settings_saved' => 'Налаштування установок швидкої допомоги збережено.'
            ],
            'maps' => [
                'sync' => 'Синхронізація мап. Зачекайте будь ласка.',
                'sync_success' => 'Мапи синхронізовані. Перезавантаження сторінки.'
            ],
            'push' => [
                'save_success' => 'Шаблон сповіщень успішно збережено.',
                'save_error' => 'Не вдалося зберегти шаблон сповіщення.',
                'remove_message' => 'Ви дійсно бажаєте видалити цей шаблон сповіщень?',
                'import_message' => 'Ви дійсно бажаєте імпортувати шаблон сповіщень за замовчуванням?',
                'import_success' => 'Шаблони Push-сповіщень було імпортовано. Сторінка перезавантажується.',
                'remove_success' => 'Шаблон сповіщень видалено.',
                'order_success' => 'Замовлення збережено.'
            ],
        ],
        'help' =>[
            'not_available' => 'Швидка допомога не можлива на цій сторінці.'
        ]
    ]
];